//1)რა განსხვავებაა let, const შორის?
//განსხვავება let, const შორის არის ის რომ const განსაზღვრული ხდებამუდმივა შესაბამისად მის მნიშვნელობას  ვერ შემცვლით განსაზღვრის შემდეგ. let-ით განასზღვრის შემდეგ კი შეგვიაძლია. ხოლო მასივების და ობიექტების შემთხვევაში ეს არ ნიშნავს რომ მნიშვნელობას ვერ შევცლით ნიშნავს ტიპს შეცვლა ხელახალი მინიჭება შეუძლებელია.

// 2)რა განსხვავებაა primitive და nonprimitive type-ებს შორის?
//ჯავასკრიპტში გვაქვს 8 ტიპი აქედან 7 არის პრიმიტიული -string,number,boolean,null,undifined,symbol, BigInt
//ხოლო არაპრიმიტულია ობიექტი რომელიც ასევე გულისხმობს მასსივს და ფუნქციებსაც მათშორის განვხვავება არის ის რომ პრიმიტიული ტიპები არა იცვლება ხოლნ პრიმიტიულის შეცვლა შეგვიძლია რადგან პრიმიტულის მისამართი არ ვიცით ხოლო არაპრიტიულებს რეფერენსის საშუალებით ვცვლით

// 3)რა განსხვავებაა == და === ოპერატორებს შორის?
//== ადარებს ველიუს ანუ მნიშვნელობის მიხედვით ხოლო === ველიუს და ტიპის მიხედვითაც ანუ 12 == "12" დაგვირუნებს ტრუს როცა  12 === "12" ფალს

// 4)რა ტიპის არის null
// null არის ობიექტის ტიპი ეს არის ჯავასკრიპტის ბაგი მაგრამ ამ ბაგის გამოსწორება კიდევ უფრო მეტ ბაგს გამოიწვევდა ამიტომ დატოვეს

// 5)რა განსხვავებაა funсtion და = () => {} შორის
//განსხვავებაა funtion და = () => {} შორის არის ის რომ funtion აქვს საკუთარი this ხოლო არროვს არა

// 6)რას ნიშნავს callback function?
// ჩვენ შეგვიძლია ფუნქციას პარამეტრად გადავცეთ ფუნქცია რომელიც გამოძახება მის შიგნით ამ ფუნქციას callback functionს უწოდებენ

// 7)რა განსხვავებაა map, filter და reduce-ს შორის?
//  map, filter და reduce არის მასივის მეთოდები map საშუალებას გვაძლევს გადავიაროთ მასივი და ვიმოქმედოთ თითოეულ ელემენტზე მაგალითად თითოეული მეთოდი გვიბრუნებს ახალ მასივს
let arr=[1,2,3,4,5,6,7,8]
let qvadratuli=arr.map((num)=>num*num);
console.log(qvadratuli)
//filter გვაძლევს საშუალებას გავფილტროთ მასივი მაგალითად ამოვიღთოთ მხოლოდ ლუწები
let even=arr.filter((num)=>num%2===0);
console.log(even);
//reduce საშუალებას გვაძლევს მთლიანი მასივი დავიყვანოთ ერთ მნიშვნელობამდე მაგალითად ის იღებს ორ პარამეტრს აკუმულიათორს და ქურენთ ველიუს ასევე შეაგვიძლი გადავცეთ დეფაულთ მნიშვნელობა
let sum =arr.reduce((acc,cur)=>acc+cur,0)
console.log(sum)

// 8)რა არის Promise?
//  პრომისი არის ობიექტი რომელსაც აქვს სამი მდგომარება pending-ოპერაცია ჯერ კიდევ მიმდინარეობს, fulfilled ოპერაცია წარმატებით დასრულდა rejected როცა ოპერაცია ვერ შესრულდა და მივიღეთ ერრორი შესაბამის განაზღვრისთვის გვჭირდება new keywordy იღებს ორ  პარამეტრს და გვირუნებს შედეგს თუ შესრულდება მაშინ რესოვლს თუ ვერა დარეჯექთდება
let promis= new Promise((res,rej)=>res("resoლved"));

// 9)რა განსხვავებაა Promise.all, Promise.race და Promise.any-ს შორის?
// Promise.all შაშუალებას გვაძლევს რამოდენიმე პრომისი გაუშვათ ერთდროულდა თუმცა თუ ერთი მაინც მათ შორის დარეჯექთდ ყველა დარეჯექთდება
//Promise.race გაშვება ის რომელიც ყველაზე პირველი შესრულდება
//Promise.any ასევეგვაძლევს საშუალებას გავუშვათ პრომისები ერთად მაგრამ დაგვიბრუნებს პირველივე  დარესოლვებულს

// 10)რას ნიშნავს async/await და რატომ ვიყენებთ?
//როცა რაიმის შესრულება გარკვეული დრო სჭირდება მეინსთეითს რომ ხელი არ შევუშალოთ ვიყენებთ async რომელიც საშუალებას გვაძლევს რომ  await დაველოდოთ შესრულებას

// 11)რა განსხვავებაა class-სა და object-ს შორის?
//class ვიყენებთ ობიექტის სტრუქტურის განასაზღვრისთვის მის ინსთანსებს წარმოადგენს ობიექტი

// 12)რას აკეთებს constructor class-ში?
//ჩვენ არ შეგვიძლია class გადვცეთ პირდაპირ პარამეტრების ანუ ვერ დავწერთ class dog(paრ1.,par2){}
//პარამეტრების გადაცემის საშულებას გვაძლევს კონსტრუქტორი class dog{constructor(pa1.,par2){this.par1=par1;this.par2=par2}} კონსტრუქტორი კლასში ავტომატურად გამოიძახება

//13) )რა განსხვავებაა მემორი ჰიპსა და მემორი სტექკს შორის?
//Memory Stack აქ ინახება პრიმიტიული მნიშვნელობები და ობიექტების მისამართები. მეხსიერების ზომა წინასწარ განსაზღვრულია და შეზღუდულია.
// Memory Heap  აქ ინახება ყველა არაპრიმიტიული ტიპი — ობიექტები, მასივები და ფუნქციები.
// რადგან ობიექტების ზომა დინამიურად იცვლება, მათთვის სტეკში ადგილი არ არის, ამიტომ ისინი ინახება ჰიპში, ხოლო მათი მისამართი იწერება სტეკში.

//14) რა არის ქოლსტეკი?
// ქოლსტეკი არის მექანიზმი, რომელსაც JavaScript იყენებს იმის გასთვალისჭინებლად თუ რომელი ფუნქცია სრულდება მოცემულ მომენტში და რა ფუნქციები უნდა შესრულდეს მის შემდეგ.
//JavaScript არის სინგლ-თრიდიანი , რაც ნიშნავს, რომ მას შეუძლია ერთდროულად მხოლოდ ერთი ოპერაციის შესრულება. შესაბამისად, მას აქვს მხოლოდ ერთი Call Stack.
//როდესაც ფუნქციას ვიძახებთ, ის ემატება  სტეკის თავში.
// როდესაც ფუნქცია ასრულებს მუშაობას ის იშლება სტეკიდან.

//15) რა არის ივენთ ლუპი?
// ივენთ ლუპი  უზრუნველყოფს ასინქრონულობას, მიუხედავად იმისა, რომ JS არის სინგლ-თრიდიანი.
//ის აკონტროლებს  Call Stack-ს და Callback Queue-ს .
// ასინქრონული კოდი მაგალითად setTimeout ხვდება Call Stack-ში.
//JS ხვდება, რომ ეს არის Web API ფუნქცია და გადაამისამართებს მას Web API-ს გარემოში, სტეკი კი მაშინვე თავისუფლდება შემდეგი კოდისთვის.
// როცა ასინქრონული ოპერაცია მორჩება , მისი Callback ფუნქცია თავსდება Callback Queue-ში..
// ივენთ ლუპი   ამოწმებს არის თუ არა Call Stack სრულიად ცარიელი
// მხოლოდ მას შემდეგ, რაც სინქრონული კოდი სრულად მორჩება მუშაობას ივენთ ლუპი იღებს პირველ ფუნქციას რიგიდან და გადააქვს ის Call Stack-ში შესასრულებლად.

